RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h755xx.s
   .weak      DFSDM1_FLT0_IRQHandler            
   .thumb_set DFSDM1_FLT0_IRQHandler,Default_Handler   

   .weak      DFSDM1_FLT1_IRQHandler            
   .thumb_set DFSDM1_FLT1_IRQHandler,Default_Handler 

   .weak      DFSDM1_FLT2_IRQHandler            
   .thumb_set DFSDM1_FLT2_IRQHandler,Default_Handler 

   .weak      DFSDM1_FLT3_IRQHandler            
   .thumb_set DFSDM1_FLT3_IRQHandler,Default_Handler    
 
   .weak      SAI3_IRQHandler            
   .thumb_set SAI3_IRQHandler,Default_Handler
   
   .weak      SWPMI1_IRQHandler            
   .thumb_set SWPMI1_IRQHandler,Default_Handler

   .weak      TIM15_IRQHandler            
   .thumb_set TIM15_IRQHandler,Default_Handler 

   .weak      TIM16_IRQHandler            
   .thumb_set TIM16_IRQHandler,Default_Handler 

   .weak      TIM17_IRQHandler            
   .thumb_set TIM17_IRQHandler,Default_Handler 

   .weak      MDIOS_WKUP_IRQHandler            
   .thumb_set MDIOS_WKUP_IRQHandler,Default_Handler 

   .weak      MDIOS_IRQHandler            
   .thumb_set MDIOS_IRQHandler,Default_Handler 

   .weak      JPEG_IRQHandler            
   .thumb_set JPEG_IRQHandler,Default_Handler 

   .weak      MDMA_IRQHandler            
   .thumb_set MDMA_IRQHandler,Default_Handler 

   .weak      SDMMC2_IRQHandler            
   .thumb_set SDMMC2_IRQHandler,Default_Handler 
   
   .weak      HSEM1_IRQHandler            
   .thumb_set HSEM1_IRQHandler,Default_Handler

   .weak      HSEM2_IRQHandler            
   .thumb_set HSEM2_IRQHandler,Default_Handler

   .weak      ADC3_IRQHandler            
   .thumb_set ADC3_IRQHandler,Default_Handler 

   .weak      DMAMUX2_OVR_IRQHandler            
   .thumb_set DMAMUX2_OVR_IRQHandler,Default_Handler 

   .weak      BDMA_Channel0_IRQHandler            
   .thumb_set BDMA_Channel0_IRQHandler,Default_Handler 

   .weak      BDMA_Channel1_IRQHandler            
   .thumb_set BDMA_Channel1_IRQHandler,Default_Handler 

   .weak      BDMA_Channel2_IRQHandler            
   .thumb_set BDMA_Channel2_IRQHandler,Default_Handler 

   .weak      BDMA_Channel3_IRQHandler            
   .thumb_set BDMA_Channel3_IRQHandler,Default_Handler 

   .weak      BDMA_Channel4_IRQHandler            
   .thumb_set BDMA_Channel4_IRQHandler,Default_Handler 

   .weak      BDMA_Channel5_IRQHandler            
   .thumb_set BDMA_Channel5_IRQHandler,Default_Handler    

   .weak      BDMA_Channel6_IRQHandler            
   .thumb_set BDMA_Channel6_IRQHandler,Default_Handler

   .weak      BDMA_Channel7_IRQHandler            
   .thumb_set BDMA_Channel7_IRQHandler,Default_Handler 

   .weak      COMP1_IRQHandler            
   .thumb_set COMP1_IRQHandler,Default_Handler 

   .weak      LPTIM2_IRQHandler            
   .thumb_set LPTIM2_IRQHandler,Default_Handler 

   .weak      LPTIM3_IRQHandler            
   .thumb_set LPTIM3_IRQHandler,Default_Handler 

   .weak      LPTIM4_IRQHandler            
   .thumb_set LPTIM4_IRQHandler,Default_Handler 

   .weak      LPTIM5_IRQHandler            
   .thumb_set LPTIM5_IRQHandler,Default_Handler 

   .weak      LPUART1_IRQHandler            
   .thumb_set LPUART1_IRQHandler,Default_Handler 

   .weak      WWDG_RST_IRQHandler            
   .thumb_set WWDG_RST_IRQHandler,Default_Handler

   .weak      CRS_IRQHandler            
   .thumb_set CRS_IRQHandler,Default_Handler 

   .weak      ECC_IRQHandler            
   .thumb_set ECC_IRQHandler,Default_Handler

   .weak      SAI4_IRQHandler            
   .thumb_set SAI4_IRQHandler,Default_Handler 

   .weak      HOLD_CORE_IRQHandler            
   .thumb_set HOLD_CORE_IRQHandler,Default_Handler 

   .weak      WAKEUP_PIN_IRQHandler            
   .thumb_set WAKEUP_PIN_IRQHandler,Default_Handler 
   
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/        
 
